src/test/resources/de/erichambuch/securitytokenservice/service/validateTokenRequest_ok.xml

<S:Envelope
	xmlns:S="http://schemas.xmlsoap.org/soap/envelope/">
	<S:Header>
		<wsse:Security
			soapenv:actor="http://schemas.xmlsoap.org/soap/actor/next"
			xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd"
			xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/">

			<wsc:SecurityContextToken
				xmlns:wsc="http://schemas.xmlsoap.org/ws/2005/02/sc"
				xmlns="http://schemas.xmlsoap.org/ws/2005/02/sc">
				<wsc:Identifier>${JWT}</wsc:Identifier>
			</wsc:SecurityContextToken>
		</wsse:Security>
	</S:Header>
	<S:Body>
		<ns3:RequestSecurityToken
			xmlns:ns1="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd"
			xmlns:ns2="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd"
			xmlns:ns3="http://schemas.xmlsoap.org/ws/2005/02/trust"
			xmlns:ns4="http://schemas.xmlsoap.org/ws/2004/08/addressing"
			xmlns:ns5="http://schemas.xmlsoap.org/ws/2004/09/policy"
			xmlns:ns6="http://www.w3.org/2000/09/xmldsig#"
			xmlns:ns7="http://www.bipro.net/namespace">
			<wst:TokenType
				xmlns:wst="http://schemas.xmlsoap.org/ws/2005/02/trust">http://schemas.xmlsoap.org/ws/2005/02/sc/sct
			</wst:TokenType>
			<wst:RequestType
				xmlns:wst="http://schemas.xmlsoap.org/ws/2005/02/trust">http://schemas.xmlsoap.org/ws/2005/02/trust/Validate
			</wst:RequestType>
		</ns3:RequestSecurityToken>
	</S:Body>
</S:Envelope>